app/controllers/regions_controller.rb

	def show
		@region = Region.find(params[:id])
		@users = @region.users.where(guide: true)
---
SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."region_id" = $1 AND "users"."guide" = $2  [["region_id", 1], ["guide", "t"]]