app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "tim"]]
---
  def create
    user = User.find_by_name(params[:session][:name])