app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "hank"], ["password_digest", "$2a$10$o6HBkawbbqJ..KhGs7xySel4Q7jWNAjjeCRlLKN7VqP8ptFTlxBdC"], ["created_at", "2016-07-30 17:14:12.010879"], ["updated_at", "2016-07-30 17:14:12.010879"]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @guide = User.find(params[:id])